In [16]:
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

In [17]:
data = pd.read_csv('AirQualityUCI.csv')
data.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,10/03/2004,18.00.00,2,6,1360,150,11,9,1046,166,1056,113,1692,1268,13
1,10/03/2004,19.00.00,2,1292,112,9,4,955,103,1174,92,1559,972,13,3
2,10/03/2004,20.00.00,2,2,1402,88,9,0,939,131,1140,114,1555,1074,11
3,10/03/2004,21.00.00,2,2,1376,80,9,2,948,172,1092,122,1584,1203,11
4,10/03/2004,22.00.00,1,6,1272,51,6,5,836,131,1205,116,1490,1110,11

In [18]:
df = data[['Date', 'Time', 'NO2(GT)']]
df.head()

         Date      Time  NO2(GT)
0  10/03/2004  18.00.00      166
1  10/03/2004  19.00.00     1174
2  10/03/2004  20.00.00      131
3  10/03/2004  21.00.00      172
4  10/03/2004  22.00.00      131

In [19]:
df.head()

         Date      Time  NO2(GT)
0  10/03/2004  18.00.00      166
1  10/03/2004  19.00.00     1174
2  10/03/2004  20.00.00      131
3  10/03/2004  21.00.00      172
4  10/03/2004  22.00.00      131

### Combining Date and Time Column

In [21]:
df['Date_Time'] = df['Date'] + ' ' + df['Time']
df.drop(['Date', 'Time'], axis=1, inplace=True)
df.head()

   NO2(GT)            Date_Time
0      166  10/03/2004 18.00.00
1     1174  10/03/2004 19.00.00
2      131  10/03/2004 20.00.00
3      172  10/03/2004 21.00.00
4      131  10/03/2004 22.00.00

In [23]:
col = ['Date_Time', 'NO2(GT)']
new_data = df[col]
new_data.head()

             Date_Time  NO2(GT)
0  10/03/2004 18.00.00      166
1  10/03/2004 19.00.00     1174
2  10/03/2004 20.00.00      131
3  10/03/2004 21.00.00      172
4  10/03/2004 22.00.00      131

In [24]:
df.to_csv('air_quality.csv', index=False)

In [7]:
df.dtypes

Date         object
Time         object
NO2(GT)       int64
Date_Time    object
dtype: object

In [10]:
df['Date'].max(), df['Date'].min()

('31/12/2004', '01/01/2005')

### Convert to datetime

In [14]:
df['Date_Time'] = pd.to_datetime(df['Date_Time'], format= '%d/%m/%Y%H.%M.%S')
df.dtypes

Date                 object
Time                 object
NO2(GT)               int64
Date_Time    datetime64[ns]
dtype: object

date month year format  ... exaples

Minimum and maximum values in the dataset

In [15]:
df['Date_Time'].max(), df['Date_Time'].min()

(Timestamp('2005-04-04 14:00:00'), Timestamp('2004-03-10 18:00:00'))

### Extract hour and minute

In [10]:
df['Date_Time'].dt.hour.head()

0    18
1    19
2    20
3    21
4    22
Name: Date_Time, dtype: int64

In [11]:
df['Date_Time'].dt.minute.head()

0    0
1    0
2    0
3    0
4    0
Name: Date_Time, dtype: int64

### The day of week - Monday (0) to Sunday (6)

In [12]:
df['Date_Time'].dt.dayofweek.head(7)

0    2
1    2
2    2
3    2
4    2
5    2
6    3
Name: Date_Time, dtype: int64

In [13]:
df['Date_Time'].dt.weekday_name.head(7)

0    Wednesday
1    Wednesday
2    Wednesday
3    Wednesday
4    Wednesday
5    Wednesday
6     Thursday
Name: Date_Time, dtype: object

### Extracting the month from the date.

In [14]:
df['Date_Time'].dt.month.head(7)

0    3
1    3
2    3
3    3
4    3
5    3
6    3
Name: Date_Time, dtype: int64

In [15]:
df['Date_Time'].dt.is_month_end.head(7)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
Name: Date_Time, dtype: bool

### Put it all together

In [16]:
new_df = pd.DataFrame({"year": df['Date_Time'].dt.year,
              "month": df['Date_Time'].dt.month,
              "day": df['Date_Time'].dt.day,
              "hour": df['Date_Time'].dt.hour,
              "dayofyear": df['Date_Time'].dt.dayofyear,
              "week": df['Date_Time'].dt.week,
              "dayofweek": df['Date_Time'].dt.dayofweek,
              "dayofweekname": df['Date_Time'].dt.weekday_name,
              "quarter": df['Date_Time'].dt.quarter,
             })
new_df.head()

   year  month  day  hour  dayofyear  week  dayofweek dayofweekname  quarter
0  2004      3   10    18         70    11          2     Wednesday        1
1  2004      3   10    19         70    11          2     Wednesday        1
2  2004      3   10    20         70    11          2     Wednesday        1
3  2004      3   10    21         70    11          2     Wednesday        1
4  2004      3   10    22         70    11          2     Wednesday        1

In [20]:
complete_data = pd.concat([df, new_df], axis=1)
complete_data.head()

,Date,Time,NO2(GT),Date_Time,year,month,day,hour,dayofyear,week,dayofweek,dayofweekname,quarter
0,10/03/2004,18.00.00,166,2004-03-10 18:00:00,2004,3,10,18,70,11,2,Wednesday,1
1,10/03/2004,19.00.00,1174,2004-03-10 19:00:00,2004,3,10,19,70,11,2,Wednesday,1
2,10/03/2004,20.00.00,131,2004-03-10 20:00:00,2004,3,10,20,70,11,2,Wednesday,1
3,10/03/2004,21.00.00,172,2004-03-10 21:00:00,2004,3,10,21,70,11,2,Wednesday,1
4,10/03/2004,22.00.00,131,2004-03-10 22:00:00,2004,3,10,22,70,11,2,Wednesday,1

### is_weekday? (Create using the dayofweek numbers)

In [35]:
complete_data['is_weekday']=0 

for i in range(0, len(complete_data)):
    if ((complete_data['dayofweek'][i] == 5) | (complete_data['dayofweek'][i] == 6)):
        complete_data['is_weekday'][i] = 0
    else: 
        complete_data['is_weekday'][i] = 1

In [36]:
complete_data[['dayofweek', 'is_weekday']].head()

   dayofweek  is_weekday
0          2           1
1          2           1
2          2           1
3          2           1
4          2           1

### Add an example of difference of dates